{
  "format": "layers-model",
  "generatedBy": "train_libras_model.py",
  "convertedBy": "manual-export",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential",
      "trainable": true,
      "dtype": "float32",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "dtype": "float32",
            "sparse": false,
            "ragged": false,
            "name": "input_layer",
            "optional": false,
            "batch_input_shape": [
              null,
              30,
              99
            ]
          }
        },
        {
          "class_name": "LSTM",
          "config": {
            "name": "lstm",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": true,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "zero_output_for_mask": false,
            "units": 64,
            "activation": "relu",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "seed": null,
                "gain": 1.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.0,
            "recurrent_dropout": 0.0,
            "seed": null
          },
          "build_config": {
            "input_shape": [
              null,
              30,
              99
            ]
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2,
            "seed": null,
            "noise_shape": null
          }
        },
        {
          "class_name": "LSTM",
          "config": {
            "name": "lstm_1",
            "trainable": true,
            "dtype": "float32",
            "return_sequences": false,
            "return_state": false,
            "go_backwards": false,
            "stateful": false,
            "unroll": false,
            "zero_output_for_mask": false,
            "units": 32,
            "activation": "relu",
            "recurrent_activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "recurrent_initializer": {
              "class_name": "Orthogonal",
              "config": {
                "seed": null,
                "gain": 1.0
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "unit_forget_bias": true,
            "kernel_regularizer": null,
            "recurrent_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "recurrent_constraint": null,
            "bias_constraint": null,
            "dropout": 0.0,
            "recurrent_dropout": 0.0,
            "seed": null
          },
          "build_config": {
            "input_shape": [
              null,
              30,
              64
            ]
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2,
            "seed": null,
            "noise_shape": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "build_config": {
            "input_shape": [
              null,
              32
            ]
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2,
            "seed": null,
            "noise_shape": null
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "build_config": {
            "input_shape": [
              null,
              128
            ]
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 10,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "quantization_config": null
          },
          "build_config": {
            "input_shape": [
              null,
              64
            ]
          }
        }
      ],
      "build_input_shape": [
        null,
        30,
        99
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "lstm/lstm_cell/kernel",
          "shape": [
            99,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm/lstm_cell/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm/lstm_cell/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/lstm_cell/kernel",
          "shape": [
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/lstm_cell/recurrent_kernel",
          "shape": [
            32,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/lstm_cell/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [
            32,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            64,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}